Revit 2024 API
ParameterTypeId.RbsComponentClassificationParam Property
 "Component Classification"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RbsComponentClassificationParam { get; }
Visual Basic
Public Shared ReadOnly Property RbsComponentClassificationParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RbsComponentClassificationParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace